---
kind: method
id: M:Autodesk.Revit.DB.ValueParsingOptions.GetFormatOptions
source: html/6e77c8d5-5936-1e3e-34a3-bce072f4ecfd.htm
---
# Autodesk.Revit.DB.ValueParsingOptions.GetFormatOptions Method

Gets the FormatOptions to optionally override the default settings in the Units class.

## Syntax (C#)
```csharp
public FormatOptions GetFormatOptions()
```

## Returns
A copy of the FormatOptions.

## Remarks
By default, the FormatOptions represents default formatting
 (UseDefault is true) and the FormatOptions in the Units class will
 be used.